'''
Напишите программу, которая принимает на вход координаты точки (X и Y),
причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
'''


def quarterPoint():
    x, y = None, None
    while type(x) != int or type(y) != int:
        try:
            x, y = map(int, input('Введите координаты точки через запятую:').split(","))
            if x > 0:
                if y > 0:
                    p = " в 1-й четверти"
                elif y < 0:
                    p = " в 4-й четверти"
                else:
                    p = " на оси X в правой полуплоскости"
            elif x < 0:
                if y > 0:
                    p = "о 2-й четверти"
                elif y < 0:
                    p = " 3-й четверти"
                else:
                    p = " на оси X в левой полуплоскости"
            else:
                if y > 0:
                    p = " на оси Y в верхней полуплоскости"
                elif y < 0:
                    p = " на оси Y в нижней полуплоскости"
                else:
                    p = " начале координат!"
        except ValueError:
            print(f"Вводите только числа!")
            continue

    return print(f"Точка находится в{p}")

wherePoint = quarterPoint()